import styles from './ArticleWhy.module.css';
import Card from '../../../shared/ui/card/Card.jsx';
import ArticleWhy1 from '../../../shared/assets/images/ArticleWhy1.png';
import ArticleWhy2 from '../../../shared/assets/images/ArticleWhy2.png';
import ArticleWhy3 from '../../../shared/assets/images/ArticleWhy3.png';

const ArticleDemand = () => {
    return (
        <div className={styles.container}>
            <h1 className={styles.title}>Попит на кров</h1>
            <p className={styles.description}>
                Попит на донорську кров постійно зростає, оскільки вона є незамінним ресурсом у медицині.
                Щодня лікарні та медичні установи використовують тисячі літрів крові для порятунку життів.
                Це необхідно для пацієнтів після важких травм, під час складних операцій, у лікуванні хронічних хвороб
                і при невідкладних медичних ситуаціях. Ваша кров може врятувати чиєсь життя – і це безцінний внесок у
                здоровя суспільства.
            </p>
            <ol className={styles.reasons}>
                <li>
                    <div className={styles.number}>1</div>
                    <div className={styles.text}>
                        <strong>Екстрені ситуації та травми</strong>
                        <p>
                            Кров потрібна негайно у випадках автомобільних аварій, виробничих травм, стихійних лих і
                            воєнних конфліктів.
                            Пацієнти можуть втрачати критичний обєм крові за лічені хвилини, тому її наявність у банках
                            крові може означати різницю між життям і смертю.
                        </p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>2</div>
                    <div className={styles.text}>
                        <strong>Лікування важких захворювань</strong>
                        <p>
                            Люди, які страждають на онкологічні захворювання, лейкемію, серповидноклітинну анемію або
                            важкі форми залізодефіцитної анемії,
                            потребують регулярних переливань крові для підтримки життєвих функцій.
                            Наприклад, пацієнти, які проходять хімієтерапію, часто стикаються з низьким рівнем
                            еритроцитів і тромбоцитів, що може загрожувати їхньому життю.
                        </p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>3</div>
                    <div className={styles.text}>
                        <strong>Хірургічні втручання</strong>
                        <p>
                            Будь-яка велика операція, зокрема трансплантація органів, кардіохірургія або операції після
                            серйозних травм,
                            часто супроводжується значною втратою крові. Донорська кров допомагає підтримати стабільний
                            стан пацієнтів під час операцій і після них.
                        </p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>4</div>
                    <div className={styles.text}>
                        <strong>Ускладнені пологи та допомога немовлятам</strong>
                        <p>
                            Жінки, які стикаються з ускладненнями під час пологів, можуть втрачати велику кількість
                            крові.
                            Донорська кров є необхідною для порятунку їхніх життів, а також для лікування немовлят,
                            які народилися з тяжкими захворюваннями або потребують інтенсивної терапії.
                        </p>
                    </div>
                </li>
            </ol>


    <div className={styles.imageBlock}>
        <Card
            image={ArticleWhy1}
            title="Групи крові"
            description="Ваші еритроцити, тромбоцити та плазма можуть врятувати до трьох життів"
            link="/article"
        />
        <Card
            image={ArticleWhy2}
            title="Навіщо здавати кров?"
            description="Здача крові рятує життя та допомагає тим, хто цього потребує."
            link="/why"
        />
        <Card
            image={ArticleWhy3}
            title="Як використовується кров"
            description="Ваші еритроцити, тромбоцити та плазма можуть врятувати до трьох життів"
            link="/using"
        />
    </div>
</div>
)
    ;
};

export default ArticleDemand;
