import styles from './ArticleWhy.module.css';
import Card from '../../../shared/ui/card/Card.jsx';
import ArticleWhy1 from '../../../shared/assets/images/ArticleWhy1.png';
import ArticleWhy2 from '../../../shared/assets/images/ArticleWhy2.png';
import ArticleWhy3 from '../../../shared/assets/images/ArticleWhy3.png';

const ArticleWhy = () => {
    return (
        <div className={styles.container}>
            <h1 className={styles.title}>Навіщо здавати кров?</h1>
            <p className={styles.description}>
                Донорство крові — це не просто благородний жест, а життєво необхідна практика, що рятує мільйони життів
                щороку. Кожні
                кілька секунд у світі комусь потрібна донорська кров. Від аварій до серйозних операцій, від онкологічних
                захворювань до
                важких пологів — всі ці ситуації вимагають швидкого доступу до запасів крові. Давайте розглянемо основні
                причини, чому
                варто стати донором крові.
            </p>
            <ol className={styles.reasons}>
                <li>
                    <div className={styles.number}>1</div>
                    <div className={styles.text}>
                        <strong>Допомога людям у критичних ситуаціях</strong>
                        <p>Перше і найголовніше — донорство крові рятує життя. Кожна здача крові може допомогти трьом
                            різним пацієнтам, адже з однієї дози виділяють плазму, тромбоцити та еритроцити. Важкі
                            травми, операції, ускладнені пологи, лікування раку — це лише частина випадків, де донорська
                            кров є незамінною.</p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>2</div>
                    <div className={styles.text}>
                        <strong>Створення резервів на випадок надзвичайних ситуацій</strong>
                        <p>Регулярне донорство дозволяє створювати необхідні запаси крові для використання під час
                            надзвичайних ситуацій: природних катастроф, епідемій або техногенних аварій. Наявність таких
                            резервів може стати вирішальним фактором у порятунку життя багатьох людей.</p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>3</div>
                    <div className={styles.text}>
                        <strong>Позитивний вплив на здоровя донора</strong>
                        <p>Здавання крові також приносить користь для самого донора. Регулярне донорство сприяє
                            оновленню крові, зменшує ризик серцево-судинних захворювань, а також допомагає контролювати
                            рівень заліза в організмі. Крім того, перед здаванням крові донори проходять медичний огляд,
                            що дозволяє своєчасно виявити можливі проблеми зі здоров’ям.</p>
                    </div>
                </li>
                <li>
                    <div className={styles.number}>4</div>
                    <div className={styles.text}>
                        <strong>Відчуття причетності до важливої справи</strong>
                        <p>Бути донором — це не лише рятувати чиєсь життя, а й стати частиною великої спільноти людей,
                            які підтримують один одного. Це дає відчуття причетності до важливої справи, що має значний
                            соціальний вплив.</p>
                    </div>
                </li>
            </ol>

            <div className={styles.imageBlock}>
                <Card
                    image={ArticleWhy1}
                    title="Групи крові"
                    description="Ваші еритроцити, тромбоцити та плазма можуть врятувати до трьох життів"
                    link="/article"
                />
                <Card
                    image={ArticleWhy2}
                    title="Попит на кров"
                    description="Дізнайтеся про фактори, які впливають на те, скільки кожної групи крові нам потрібно зібрати"
                    link="/demand" />
                <Card
                    image={ArticleWhy3}
                    title="Як використовується кров"
                    description="Ваші еритроцити, тромбоцити та плазма можуть врятувати до трьох життів"
                    link="/using" />
            </div>
        </div>
    );
};

export default ArticleWhy;
