export const questions = [
    {
        text: "У вас є чи були у вас захворювання серця?",
        options: [
            {
                answer: "Так",
                result: "У вас є захворювання серця",
                message: "Нам потрібна додаткова інформація, щоб знати, чи можете ви зробити пожертву. Щоб дати вам відповідь, нам потрібно з вами поговорити."
            },
            { answer: "Ні", next: 1 }
        ]
    },
    {
        text: "Ви вагітні або у вас була дитина, викидень або переривання вагітності протягом останніх 6 місяців?",
        options: [
            {
                answer: "Так",
                result: "Так, я вагітна або народила дитину, викидень або переривання вагітності протягом останніх 6 місяців ",
                message: "Ви не можете здавати кров, плазму або тромбоцити, якщо ви вагітні. Будь ласка, зачекайте 6 місяців після закінчення вашої вагітності, перш ніж робити донорство. Якщо вам переливали кров під час вагітності або під час пологів, ви не можете зробити донорство. Будь ласка, також переконайтеся, що ви здорові та здорові, не потребуєте подальших обстежень чи спостереження, і ви не проходите лікування від дефіциту заліза."
            },
            { answer: "Ні", next: 2 }
        ]
    },
    {
        text: "Чи були ви за межами країни протягом останніх 4 місяців?",
        options: [
            {
                answer: "Так",
                result: "Так, я був за межами країни протягом останніх 4 місяців",
                message: "Подорож до деяких частин світу може вплинути на вашу здатність здавати кров, плазму чи тромбоцити."
            },
            { answer: "Ні", next: 3 }
        ]
    },{
        text: "Чи здавали ви кров, плазму чи тромбоцити протягом останніх 16 тижнів?",
        options: [
            {
                answer: "Так", next: 4
            },
            { answer: "Ні", next: 5 }
        ]
    },

    {
        text: "Ваша наступна донорська донація – кров, плазма чи тромбоцити?",
        options: [
            {
                answer: "Кров",
                result: "Я здавав кров ",
                message: "Якщо при народженні ваша стать чоловіча , ви можете здати кров, якщо минуло 12 тижнів після останньої здачі крові або 4 тижні з моменту останньої здачі плазми чи тромбоцитів. Якщо при народженні ваша стать жіноча , ви можете здати кров, якщо минуло 16 тижнів після останньої здачі крові або 4 тижні після останньої здачі плазми чи тромбоцитів. Якщо ви інтерсекс , ви можете здати кров, якщо минуло 16 тижнів після останньої здачі крові або 4 тижні після останньої здачі плазми чи тромбоцитів."
            },
            {
                answer: "Плазма",
                result: "Я здавав плазму ",
                message: "Ви можете здавати плазму, якщо минуло 2 тижні з моменту останньої здачі плазми або 4 тижні з моменту останньої здачі крові."
            },
            {
                answer: "Тромбоцити",
                result: "Я здавав тромбоцити ",
                message: ": Ви можете здати тромбоцити, якщо пройшло 2 тижні після останньої здачі тромбоцитів або 4 тижні після останньої здачі крові."
            }

        ]
    },{
        text: "Чи робили вам гнучку ендоскопію або колоноскопію протягом останніх 4 місяців?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 4 місяців мені робили гнучку ендоскопію або колоноскопію ",
                message: "відповідь На жаль, перед тим, як здати кров, плазму чи тромбоцити, вам доведеться зачекати 4 місяці з дати вашої процедури."
            },
            { answer: "Ні", next: 6 }
        ]
    },{
        text: "Протягом останніх 4 місяців чи робили ви татуювання або будь-які косметичні процедури, які передбачали проколювання шкіри?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 4 місяців я робив татуювання або робив косметичну процедуру, яка включала пірсинг шкіри ",
                message: "На жаль, перед тим, як здати кров, плазму або тромбоцити, вам доведеться зачекати 4 місяці з дати татуювання або косметичної процедури."
            },
            { answer: "Ні", next: 7 }
        ]
    },{
        text: "Чи проходили ви акупунктуру протягом останніх 4 місяців?",
        options: [
            {
                answer: "Так",
                result: ": Так, протягом останніх 4 місяців я робив акупунктуру",
                message: " Ви можете зробити пожертвування, залежно від того, хто проводив лікування."
            },
            { answer: "Ні", next: 8 }
        ]
    },{
        text: "Чи робили вам пірсинг за останні 4 місяці?",
        options: [
            {
                answer: "Так",
                result: "Так, я робив пірсинг протягом останніх 4 місяців ",
                message: "На жаль, перед тим, як здати кров, плазму чи тромбоцити, вам доведеться зачекати 4 місяці з дати пірсингу."
            },
            { answer: "Ні", next: 9 }
        ]
    },{
        text: "Чи були у вас секс з новим партнером або з кількома партнерами протягом останніх 3 місяців?",
        options: [
            {
                answer: "Так",next: 10
            },
            { answer: "Ні", next: 11 }
        ]
    },{
        text: "Коли ви займалися сексом з новим партнером або з більш ніж одним партнером протягом останніх 3 місяців, чи займалися ви анальним сексом?",
        options: [
            {
                answer: "Так",
                result: "Так, у мене був анальний секс з новим партнером або з більш ніж одним партнером протягом останніх 3 місяців",
                message: "На жаль, ви не можете здати кров, плазму або тромбоцити, якщо у вас був анальний секс з новим партнером або більше ніж з одним партнером протягом останніх 3 місяців. Вам потрібно почекати 3 місяці, перш ніж робити пожертвування."
            },
            { answer: "Ні", next: 11 }
        ]
    },{
        text: "Чи контактували ви з кимось із інфекційними захворюваннями протягом останніх 4 тижнів?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 4 тижнів я контактував з інфекційним хворим ",
                message: "Нам потрібна додаткова інформація, щоб знати, чи можете ви зробити пожертву. Щоб дати вам відповідь, нам потрібно з вами поговорити. Тривалість часу, який вам потрібно чекати перед донорством, залежатиме від захворювання, з яким ви стикалися."
            },
            { answer: "Ні", next: 12 }
        ]
    },{
        text: "Чи були у вас інфекція протягом останніх 2 тижнів або чи приймали ви антибіотики протягом останніх 7 днів?",
        options: [
            {
                answer: "Так",
                result: "Так, у мене була інфекція протягом останніх 2 тижнів або я приймав антибіотики протягом останніх 7 днів",
                message: "На жаль, ви повинні повністю вилікуватися або одужати від будь-якої інфекції протягом 2 тижнів, перш ніж ви зможете здати кров, плазму або тромбоцити. Якщо ви приймали антибіотики, ви повинні зачекати 7 днів після прийому останньої таблетки, перш ніж здавати."
            },
            { answer: "Ні", next: 13 }
        ]
    },{
        text: "Чи були у вас кашель, біль у горлі чи будь-які симптоми застуди протягом останніх 7 днів?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 7 днів у мене був кашель, біль у горлі або симптоми застуди ",
                message: "Вибачте, якщо у вас виникли будь-які з цих симптомів, вам потрібно зачекати 7 днів, перш ніж ви зможете здати кров, плазму або тромбоцити."
            },
            { answer: "Ні", next: 14 }
        ]
    },
    {
        text: "Чи лікували ви зуби протягом останніх 7 днів, чи проводите стоматологічну роботу?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 7 днів я проходив стоматологічне лікування або зараз проходжу стоматологічне лікування",
                message: "Нам потрібна додаткова інформація, щоб знати, чи можете ви зробити пожертву. Прості пломби та перевірки зазвичай приходять у норму через 24 години. Однак деякі методи лікування означатимуть, що вам доведеться чекати довше перед донорством."
            },
            { answer: "Ні", next: 15 }
        ]
    },
    {
        text: "У вас активний герпес?",
        options: [
            {
                answer: "Так",
                result: "Так, у мене активний герпес",
                message: "На жаль, якщо у вас активний герпес, ви не можете здати кров, плазму чи тромбоцити. Ви можете зробити пожертвування, якщо герпес сухий і не поколює. Якщо ви приймали таблетки для лікування герпесу, ви повинні зачекати 7 днів після прийому останньої таблетки, перш ніж здавати."
            },
            { answer: "Ні", next: 16 }
        ]
    },
    {
        text: "Чи робили вам будь-які щеплення, щеплення або уколи протягом останніх 8 тижнів?",
        options: [
            {
                answer: "Так",
                result: "Так, протягом останніх 8 тижнів я робив щеплення, щеплення чи щеплення",
                message: "Якщо ви зробили щеплення від Covid, ви можете здати кров, плазму або тромбоцити в той же день, якщо почуваєтеся добре. Якщо ви зробили щеплення проти грипу шляхом ін’єкції, ви можете здати кров, плазму або тромбоцити в той же день, якщо ви почуваєтеся добре. Якщо ви зробили щеплення від грипу назальним спреєм, вам слід зачекати 4 тижні перед донорством. Для інших щеплень, щеплень або ін'єкцій можуть бути інші періоди очікування. Скористайтеся посиланням нижче, щоб перевірити, або зателефонуйте в наш контакт-центр, якщо ви не впевнені, скільки вам потрібно чекати."
            },
            { answer: "Ні", next: "complete" }
        ]
    },
];
