import styles from './AboutUs.module.css';

import processImage from '../../../shared/assets/images/preview.svg';
import handHeartImage from '../../../shared/assets/images/quote.png';
import teamImage from '../../../shared/assets/images/doctors.png';

const AboutUs = () => {
    return (
        <div className={styles.container}>
            <section >
                <h1 className={styles.title}>Про нас</h1>
                <div className={styles.two_columns}>
                    <div className={styles.col_t}>
                        <h2 >Про нас</h2>
                        <h2 >Наша команда</h2>
                    </div>
                    <div className={styles.team_d}>
                        <p>На нашому сайті ви знайдете всю необхідну інформацію про донорство крові – важливу і благородну місію, що допомагає рятувати життя. Ми прагнемо зробити процес донорства максимально зручним і зрозумілим для кожного. Від новин і порад для донорів до детального пояснення процедури здачі крові – наш ресурс створений для того, щоб підтримати вас на кожному етапі. Ми також ділимося історіями тих, кому донорська кров вже врятувала життя, щоб надихнути більше людей на участь у цій життєво важливій справі.</p>
                        <p>Наша команда обєднує лікарів, волонтерів і активістів, які щодня працюють над тим, щоб зробити донорство крові доступним і безпечним для всіх. Ми співпрацюємо з медичними установами по всій країні, забезпечуючи актуальну інформацію про пункти збору крові та заходи для донорів. Приєднуйтесь до нашої спільноти і станьте частиною руху, який змінює життя людей на краще.</p>
                    </div>
                </div>
            </section>

            <section className={styles.section_full_width_image}>
                <img src={processImage} alt="Процес донорства крові" />
            </section>

            <section className={styles.section}>
                <div className={styles.quote}>
                    <p>Донорство крові — це простий акт, який може врятувати чиєсь життя...</p>
                </div>
                <div className={styles.quote}>
                    <img src={handHeartImage} alt="Hand with heart" />
                </div>
            </section>

            <section className={styles.section3}>
                <div className={styles.team}>
                    <div className={styles.team_member}>
                        <img src={teamImage} alt="Команда 1" />
                    </div>
                    <div className={styles.team_d}>
                        <h1 className={styles.title2}>Команда</h1>
                        <p>На нашому сайті ви знайдете всю необхідну інформацію про донорство крові – важливу і благородну місію, що допомагає рятувати життя. Ми прагнемо зробити процес донорства максимально зручним і зрозумілим для кожного. Від новин і порад для донорів до детального пояснення процедури здачі крові – наш ресурс створений для того, щоб підтримати вас на кожному етапі. Ми також ділимося історіями тих, кому донорська кров вже врятувала життя, щоб надихнути більше людей на участь у цій життєво важливій справі.</p>
                    <p>Наша команда обєднує лікарів, волонтерів і активістів, які щодня працюють над тим, щоб зробити донорство крові доступним і безпечним для всіх. Ми співпрацюємо з медичними установами по всій країні, забезпечуючи актуальну інформацію про пункти збору крові та заходи для донорів. Приєднуйтесь до нашої спільноти і станьте частиною руху, який змінює життя людей на краще.</p>
                    </div>
                </div>
            </section>
        </div>
    );
};

export default AboutUs;
